//               입력받은값이 5일때       별       공백
//1층                *                   1        8(2*4)
//2층               ***                  3        6(2*3) 
//3층              *****                 5        4(2*2)
//4층             *******                7        2(2*1)  
//5층            *********               9        0(2*0)
//6층             *******                7        2(2*1)
//7층              *****                 5        4(2*2)
//8층               ***                  3        6(2*3)
//9층                *                   1        8(2*4)

let 입력받은값 = 5; //홀수값
let output = ''; // 결과값 담을 변수값

for(let i=1; i<=(2*입력받은값-1); i++){
    if(i<=입력받은값){ //1부터 5까지일때 5층까지        
        //1.공백찍기
        for( let a = 1 ; a<=2*입력받은값-i; a++ ){                           //i층               입력받은값이 5일때       별       공백                 
            output += ' '                                                    //1층                *                      1        8(2*4)
        }                                                                    //2층               ***                     3        6(2*3) 
        //2. 별찍기                                                          //3층              *****                    5        4(2*2)
        for( let b = 1 ; b<=2*i-1; b++ ){                                    //4층             *******                   7        2(2*1) 
                                                                             //5층            *********                  9        0(2*0)
            output += '*'
        }
        //  3. 줄바꿈처리 
        output += '\n'
  }
  else  if(i>입력받은값){ //6부터9까지일때 6층에서 9층까지                    //6층             *******               7=(2*4)-1 = 1+(2*3))       2(2*1)
                                                                             //7층              *****                5=(2*3)-1 = 1+(2*2)        4(2*2)
                                                                            
        //1.별찍기
        for( let d = 1; d<=(2*입력받은값-i)*2-1; d++){                       //8층               ***                3=(2*2)-1 = 1+(2*1)       6(2*3)
            output += '*'                                                    //9층                *                  1=(2*1)-1 = 1+(2*0)        8(2*4)
        }
                                                                             //2. 공백찍기                                                         
        for( let c = 1; c<=(i-입력받은값)*2; c++ ){                             
            output += ' '                                                      // 2*입력받은값===10 -i(6) =====4      
        }
        //  3. 줄바꿈처리 
        output += '\n'
  }
}
console.log(output)
